app/views/recipe_foods/new.html.erb

SELECT "foods".* FROM "foods" ORDER BY "foods"."name" ASC
---
    <label for="foods">Select a Food</label>
    <%= form.select :food_id, options_for_select(@foods.map { |food| [food.name, food.id] }), {}, { id: 'food' } %>