app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 2]]
---
  def index
    @foods = Food.where(user_id: current_user.id)

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "beans"], ["measurement_unit", "kg"], ["price", "12.0"], ["quantity", 2], ["user_id", 2], ["created_at", "2024-01-29 15:24:48.464590"], ["updated_at", "2024-01-29 15:24:48.464590"]]
---
  def create
    @food = Food.new(food_params)
    @food.user = current_user

    if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]
---
  def destroy
    @food = Food.find(params[:id])
    if @food.destroy

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_food
    @food = Food.find(params[:id])