app/controllers/recipe_foods_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 2]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."food_id" = $1 AND "recipe_foods"."recipe_id" = $2 ORDER BY "recipe_foods"."id" ASC LIMIT $3  [["food_id", 5], ["recipe_id", 2], ["LIMIT", 1]]
---
  def new
    @recipe = Recipe.find(params[:recipe_id])
    @recipe_food = RecipeFood.new
    # @foods = current_user.foods.includes(:recipe_foods).where.not(recipe_foods: { recipe: @recipe })

    @foods = current_user.foods.select do |food|
      recipe_foods = food.recipe_foods.select { |recipe_food| recipe_food.recipe == @recipe }
      recipe_foods.empty?

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "recipe_foods" ("recipe_id", "food_id", "user_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["recipe_id", 2], ["food_id", 3], ["user_id", 2], ["quantity", 2], ["created_at", "2024-01-30 08:52:19.979905"], ["updated_at", "2024-01-30 08:52:19.979905"]]
SELECT "foods".* FROM "foods"
---
  def create
    @recipe = Recipe.find_by(id: params[:recipe_id])
    @recipe_food = RecipeFood.new(recipe_food_params)
    @recipe_food.recipe_id = @recipe.id
    @recipe_food.user_id = current_user.id

    if @recipe_food.save
      redirect_to @recipe
    else
      @foods = Food.all

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1  [["id", 2]]
DELETE FROM "recipe_foods" WHERE "recipe_foods"."id" = $1  [["id", 5]]
---
  def destroy
    @recipe = Recipe.find_by(id: params[:recipe_id])
    @recipe_food = RecipeFood.includes(:recipe).find_by(id: params[:id])
    if @recipe_food
      @recipe_food.destroy

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 2]]
---
  def general_shopping_list
    @foods = current_user.foods.all.select { |food| food.food_remnant.negative? }